// Задача 1.
// Создайте объект с ключами от 1 до 7, в качестве значений содержащий имена дней недели. 
// Выведите на экран все его элементы.

// Решение 1.
// let obj = {
//     1: 'Понедельник',
//     2: 'Вторник',
//     3: 'Среда',
//     4: 'Четверг',
//     5: 'Пятница',
//     6: 'Суббота',
//     7: 'Воскресенье'
// }


// Задача 2. 
// Создайте объект user с ключами 'name', 'surname', 'patronymic' и какими-то произвольными значениями. 
// Выведите на экран фамилию, имя и отчество через пробел.

// Решение 2.
// let user = {
//     'name' : 'Никита',
//     'surname' : 'Капурин', 
//     'patronymic' : 'Вячеславович'
// }
// alert(user['name'] + ' ' + user['surname'] + ' ' + user['patronymic;']);


// Задача 3. 
// Создайте пустой объект, а затем заполните его значениями.

// Решение 3.
// let obj = {};
// obj[0] = 1;
// obj[1] = 2;
// obj[2] = 3;


// Задача 4.
// Получите массив ключей следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 4.
// let obj = {x: 1, y: 2, z: 3};
// alert(Object.keys(obj));


// Задача 5.
// Найдите количество элементов в следующем объекте:
// let obj = {x: 1, y: 2, z: 3};

// Решение 5.
// let obj = {x: 1, y: 2, z: 3};
// alert(Object.keys(obj).length);