// Задание 1.
// Запустите таймер, который каждые 3 секунды будет что-нибудь выводить в консоль.
// setInterval(function() {
//     console.log("Вот и прошло 3 секунды");
// }, 3000);


// Здание 2.
// Пусть дана переменная, в которой изначально хранится число 100. 
// Запустите таймер, который каждую секунду будет уменьшать значение этой переменной на 1 и выводить это значение в консоль.
// let count = 100;
// setInterval(() => console.log(count--), 1000);


// Задание 3.
// Пусть дана переменная, в которой изначально хранится число 10. 
// Запустите таймер, который каждую секунду будет уменьшать значение этой переменной на 1 и выводить это значение в консоль. 
// Как только значение переменной достигнет нуля - остановите таймер.

// let count = 10;
// let timerId = setInterval(() => {
//     console.log(count--);

//     if (count == 0) {
//         clearInterval(timerId);
//     }
// }, 1000);


// Задание 4.
// Сделайте кнопку, по нажатию на которую в консоль будет выводится обратный отсчет, начиная с 100.
// let button = document.querySelector('#start');

// button.addEventListener('click', () => {
//     let count = 100;

//     setInterval(() => console.log(count--), 1000)
// })