// Задача 1.
// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.

// Решение 1.
// let num = 123;
// alert(num);


// Задача 2.
// Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.

// Решение 2.
// let a = 10;
// alert(a);
// a = 20;
// alert(a);


// Задача 3.
// Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

// Решение 3.
// let a = 1 + 2 + 3;
// alert (a);


// Задача 4.
// Создайте переменную a со значением 10 и переменную b со значением 2. 
// Выведите на экран их сумму, разность, произведение и частное (результат деления).

// Решение 4.
// let a = 10, b = 2;
// alert(`Сумма: ${a + b}, разность: ${a - b}, произведение: ${a * b}, частное: ${a / b}`);


// Задача 5.
// Создайте переменную c со значением 10 и переменную d со значением 5. 
// Просуммируйте их, а результат присвойте переменной result. 
// Выведите на экран значение переменной result.

// Решение 5.
// let c = 10, d = 5;
// let result = c + d;
// alert(result);


// Задача 6.
// Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. 
// Выведите на экран их сумму.

// Решение 6.
// let a = 1, b = 2, c = 4;
// alert(a + b + c);


// Задача 7.
// Создайте переменную a со значением 10 и переменную b со значением 5. 
// Отнимите от a переменную b и результат присвойте переменной c. 
// Затем создайте переменную d, присвойте ей значение 7. 
// Сложите переменные c и d, а результат запишите в переменную result. 
// Выведите на экран значение переменной result.

// Решение 7.
// let a = 10, b = 5;
// let c = a - b;
// let d = 7;
// let result = c + d;
// alert(result);


// Задача 8.
// Запишите в переменную a число 1.5, а в переменную b - число 0.75. 
// Найдите сумму значений этих переменных и выведите ее на экран.

// Решение 8.
// let a = 1.5, b = 0.75;
// alert(a + b);


// Задача 9.
// Создайте переменную a со значением -100. Выведите это значение на экран.

// Решение 9.
// let a = -100;
// alert(a);


// Задача 10.
// Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. 
// Выведите на экран это число с обратным знаком.

// Решение 10.
// let a = 10;
// alert(-a);


// Задача 11.
// Найдите остаток от деления следующих переменных:
// let a = 13;
// let b = 5;

// Решение 11.
// let a = 13, b = 5;
// alert(a % b);


// Задача 12.
// Возведите число 2 в 10-ю степень. Выведите результат на экран.

// Решение 12.
// alert(2 ** 10);


// Задача 13.
// Создайте переменную str и присвойте ей строку '!!!'. 
// Выведите значение этой переменной на экран.

// Решение 13.
// let str = "!!!";
// alert(str);


// Задача 14.
// Создайте переменную с текстом 'java' и переменную с текстом 'script'. 
// С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.

// Решение 14.
// let str1 = 'java', str2 = 'script';
// alert(str1 + str2);


// Задача 15.
// Создайте переменную с текстом 'hello' и переменную с текстом 'world'. 
// С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'.

// Решение 15.
// let str1 = 'hello', str2 = 'world';
// alert(str1 + ' ' + str2);


// Задача 16.
// Запишите в переменную какую-нибудь строку. Выведите на экран длину вашей строки.

// Решение 16.
// let str = "Hello World";
// alert(str.length);