// Задача 1.
// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.

// Решение 1.
// let num = 123;
// alert(num);


// Задача 2.
// Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.

// Решение 2.
// let a = 10;
// alert(a);
// a = 20;
// alert(a);


// Задача 3.
// Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

// Решение 3.
// let a = 1 + 2 + 3;
// alert (a);