// Задание 1.
// Дан следующий массив:
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'. 

// Решение.
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// console.log(arr[3][2] + ' ' + arr[1][1] + ' ' + arr[2][0] + ' ' + arr[0][0]);


// Задание 2.
// Дан двухмерный массив с числами:
// let arr = [[1, 2, 3], [4, 5], [6]];
// С помощью вложенных циклов найдите сумму элементов этого массива. 

// Решение
// let arr = [[1, 2, 3], [4, 5], [6]];
// for (let sub_Arr of arr) {
//     for (let elem of sub_Arr) {
//         console.log(elem);
//     }
// }


// Задание 3.
// Дан трехмерный массив с числами:
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// С помощью вложенных циклов найдите сумму элементов этого массива. 

// Решение
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// for (let mega_Sub_Arr of arr) {
//     for (let sub_Arr of mega_Sub_Arr) {
//         for (let elem of sub_Arr) {
//             console.log(elem);
//         }
//     }
// }


// Задание 4.
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

// Решение
// let arr = [];
// for (let i = 0; i < 3; i++) {
//     arr[i] = []
//     for (let j = 1; j <= 5; j++) {
//         arr[i].push(j);
//     }
// }
// console.log(arr);


// Задание 5.
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x']
// ]

// Решение
// let arr = [];
// for (let i = 0; i < 3; i++) {
//     arr[i] = [];

//     for (let j = 0; j < 4; j++) {
//         arr[i].push('x');
//     }
// }
// console.log(arr);


// Задание 6.
// Сформируйте с помощью трех вложенных циклов следующий массив:
// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]

// Решение
// let arr = [];
// for (let i = 0; i < 3; i++) {
//     arr[i] = [];
//     for (let j = 0; j < 2; j++) {
//         arr[i][j] = [];
//         for (let k = 0; k < 5; k++) {
//             arr[i][j].push(k);
//         }
//     }
// }
// console.log(arr);