// Задание 1.
// Дан следующий массив:
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'. 

// Решение.
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// console.log(arr[3][2] + ' ' + arr[1][1] + ' ' + arr[2][0] + ' ' + arr[0][0]);


// Задание 2.
// Дан двухмерный массив с числами:
// let arr = [[1, 2, 3], [4, 5], [6]];
// С помощью вложенных циклов найдите сумму элементов этого массива. 

// Решение
// let arr = [[1, 2, 3], [4, 5], [6]];
// for (let sub_Arr of arr) {
//     for (let elem of sub_Arr) {
//         console.log(elem);
//     }
// }


// Задание 3.
// Дан трехмерный массив с числами:
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// С помощью вложенных циклов найдите сумму элементов этого массива. 

// Решение
let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
for (let mega_Sub_Arr of arr) {
    for (let sub_Arr of mega_Sub_Arr) {
        for (let elem of sub_Arr) {
            console.log(elem);
        }
    }
}