// Задание 1.
// Дан следующий массив:
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'. 

// Решение.
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// console.log(arr[3][2] + ' ' + arr[1][1] + ' ' + arr[2][0] + ' ' + arr[0][0]);


// Задание 2.
// Дан двухмерный массив с числами:
// let arr = [[1, 2, 3], [4, 5], [6]];
// С помощью вложенных циклов найдите сумму элементов этого массива. 

// Решение
// let arr = [[1, 2, 3], [4, 5], [6]];
// for (let sub_Arr of arr) {
//     for (let elem of sub_Arr) {
//         console.log(elem);
//     }
// }


// Задание 3.
// Дан трехмерный массив с числами:
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// С помощью вложенных циклов найдите сумму элементов этого массива. 

// Решение
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// for (let mega_Sub_Arr of arr) {
//     for (let sub_Arr of mega_Sub_Arr) {
//         for (let elem of sub_Arr) {
//             console.log(elem);
//         }
//     }
// }


// Задание 4.
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

// Решение
// let arr = [];
// for (let i = 0; i < 3; i++) {
//     arr[i] = []
//     for (let j = 1; j <= 5; j++) {
//         arr[i].push(j);
//     }
// }
// console.log(arr);


// Задание 5.
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x']
// ]

// Решение
// let arr = [];
// for (let i = 0; i < 3; i++) {
//     arr[i] = [];

//     for (let j = 0; j < 4; j++) {
//         arr[i].push('x');
//     }
// }
// console.log(arr);


// Задание 6.
// Сформируйте с помощью трех вложенных циклов следующий массив:
// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]

// Решение
// let arr = [];
// for (let i = 0; i < 3; i++) {
//     arr[i] = [];
//     for (let j = 0; j < 2; j++) {
//         arr[i][j] = [];
//         for (let k = 0; k < 5; k++) {
//             arr[i][j].push(k);
//         }
//     }
// }
// console.log(arr);


// Задание 7.
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2], [3, 4], [5, 6], [7, 8]]

// Решение
// let arr = [];
// let count = 1;
// for (let i = 0; i < 4; i++) {
//     arr[i] = [];
//     for (let j = 0; j < 2; j++) {
//         arr[i].push(count);
//         count++;
//     }
// }
// console.log(arr);


// Задание 8.
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]

// Решение
// let arr = [];
// let count = 2;
// for (let i = 0; i < 4; i++) {
//     arr[i] = []
//     for (let j = 0; j < 3; j++) {
//         arr[i].push(count);
//         count += 2; 
//     }
// }
// console.log(arr);


// Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:
// [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]

// Решение
// let arr = [];
// let count = 1;
// for (let i = 0; i < 2; i++) {
//     arr[i] = [];
//     for (let j = 0; j < 2; j++) {
//         arr[i][j] = [];
//         for (let k = 0; k < 2; k++) {
//             arr[i][j].push(count);
//             count++;
//         }
//     }
// }
// console.log(arr);


// Задание 9.
// Используя циклы, найдите сумму элементов этого объекта.

// Решение
// let obj = {
// 	1: {
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	2: {
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	3: {
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// }
// let sum = 0;

// for (let key in obj) {
//     let subObj = obj[key];
//     for (let subKey in subObj) {
//         sum += subObj[subKey];
//     }
// }
// console.log(sum);


// Задание 10.
// Используя циклы, найдите сумму элементов этого объекта.

// Решение
// let obj = {
// 	1: {
// 		1: {
// 			1: 111,
// 			2: 112,
// 			3: 113,
// 		},
// 		2: {
// 			1: 121,
// 			2: 122,
// 			3: 123,
// 		},
// 	},
// 	2: {
// 		1: {
// 			1: 211,
// 			2: 212,
// 			3: 213,
// 		},
// 		2: {
// 			1: 221,
// 			2: 222,
// 			3: 223,
// 		},
// 	},
// 	3: {
// 		1: {
// 			1: 311,
// 			2: 312,
// 			3: 313,
// 		},
// 		2: {
// 			1: 321,
// 			2: 322,
// 			3: 323,
// 		},
// 	},
// }
// let sum = 0;
// for (let key in obj) {
//     let subObj = obj[key];
//     for (let subKey in subObj) {
//         let subObjSub = subObj[subKey]
//         for (let subKeySub in subObjSub) {
//             sum = subObjSub[subKeySub];
//         }
//     }
// }
// console.log(sum);


// Задание 11.
// Выведите на экран данные каждого работника в формате имя - зарплата.
// let employees = [
// 	{
// 		name: 'name1',
// 		salary: 300,
// 	},
// 	{
// 		name: 'name2',
// 		salary: 400,
// 	},
// 	{
// 		name: 'name3',
// 		salary: 500,
// 	},
// ];

// Решение 
// for (let elem of employees) {
//     document.write(`${elem.name} - ${elem.salary} <br>`);
// }


// Задание 12.
// Выведите на экран сумму зарплат всех работников.

// Решение
// let employees = [
// 	{
// 		name: 'name1',
// 		salary: 300,
// 	},
// 	{
// 		name: 'name2',
// 		salary: 400,
// 	},
// 	{
// 		name: 'name3',
// 		salary: 500,
// 	},
// ];
// let sum = 0;
// for (let elem of employees) {
//     sum += elem.salary;
// }