// Задание 1.
// В переменной month лежит какое-то число из интервала от 1 до 12. 
// Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).


// Решение 1.
// let month = 4;
// if (month == 12 || (month >= 1 && month <= 2)) {
//     console.log('Зима');
// } else if (month >= 3 && month <= 5) {
//     console.log('Весна');
// } else if (month >= 6 && month <= 8) {
//     console.log('Лето');
// } else if (month >= 9 && month <= 11) {
//     console.log('Осень');
// } else {
//     console.log('Неверные данные');
// }


// Задание 2.
// Дана строка, состоящая из символов, например, 'abcde'. 
// Проверьте, что первым символом этой строки является буква 'a'. 
// Если это так - выведите 'да', в противном случае выведите 'нет'.

// Решение 2.
// let str = 'abcde';
// if (str[0] == 'a') {
//     console.log('Да');
// } else {
//     console.log('Нет');
// }


// Задание 3.
// Дано число, например, 12345. 
// Проверьте, что первым символом этого числа является цифра 1, 2 или 3. 
// Если это так - выведите 'да', в противном случае выведите 'нет'.

// Решение 3.
// let number = 12345;
// if (Number(String(number)[0]) >= 1 && Number(String(number)[0]) <= 3) {
//     console.log('Да');
// } else {
//     console.log('Нет');
// }


// Задание 4.
// Дано трехзначное число. Найдите сумму цифр этого числа.

// Решение 4.
// let num = 432;
// console.log(Number(String(num)[0]) + Number(String(num)[1]) + Number(String(num)[2]));

// Задание 5.
// Дано число из 6-ти цифр. 
// Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. 
// Если это так - выведите 'да', в противном случае выведите 'нет'.

// Решение 5.
// let num = 645546;
// let sum1 = Number(String(num)[0]) + Number(String(num)[1]) + Number(String(num)[2]);
// let sum2 = Number(String(num)[3]) + Number(String(num)[4]) + Number(String(num)[5]);
// if (sum1 == sum2) {
//     console.log('Да');
// } else {
//     console.log('Нет');
// }