// Задача 1.
// Перепишите следующий код с использованием сокращенной формы:
// let test = true;
// if (test === true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// Решение 1.
// let test = true;
// if (test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// Задача 2.
// Проверьте, что переменная test равна 10, то пусть на экран выведется 'yes'. 
// В противном случае пусть ничего не произойдет.

// Решение 2.
// let test = 10;
// if (test == 10) {
//     console.log('yes');
// }


// Задача 3.
// Пусть в переменной num хранится число. 
// Если это число попадает в диапазон от 10 до 99, то найдите сумму цифр этого числа. 
// Если полученная сумма меньше или равна 9, то выведите сообщение о том, что сумма цифр однозначна, 
// в противном случае выведите сообщение о том, что сумма цифр двухзначна.

// Решение 3.
// let num = 24;
// if (num >= 10 && num <= 99) {
//     if ((+String(num)[0] + +String(num)[1]) <= 9) {
//         console.log('Цифра однозначная');
//     } else {
//         console.log('Цифра двухзначна');
//     }
// }


// Задача 4.
// Перепишите следующий код через switch-case:
// let lang = 'ru';
// if (lang == 'ru') {
// 	console.log('рус');
// } else if (lang == 'en') {
// 	console.log('анг');
// } else if (lang == 'de') {
// 	console.log('нем');
// } else {
// 	console.log('язык не поддерживается');
// }

// Решение 4.
// let lang = 'ru';
// switch (lang) {
//     case 'ru':
//         console.log('рус');
//     break;
//     case 'en':
//         console.log('анг');
//     break;
//     case 'de':
//         console.log('нем');
//     break;
//     default:
//         console.log('Язык не поддерживается');
//     break;
// }


// Задача 5.
// Перепишите следующий код через тернарный оператор:
// let num = 1;
// let res;
// if (num >= 0) {
// 	res = '1';
// } else {
// 	res = '2';
// }
// console.log(res);
// let num = 1;
// let res = (num >= 0) ? '1' : '2';
// console.log(res);