// Задача 1.
// Перепишите следующий код с использованием сокращенной формы:
// let test = true;
// if (test === true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// Решение 1.
// let test = true;
// if (test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// Задача 2.
// Проверьте, что переменная test равна 10, то пусть на экран выведется 'yes'. 
// В противном случае пусть ничего не произойдет.

// Решение 2.
// let test = 10;
// if (test == 10) {
//     console.log('yes');
// }