// Задача 1.
// Перепишите следующий код с использованием сокращенной формы:
// let test = true;
// if (test === true) {
// 	console.log('+++');
// } else {
// 	console.log('---');
// }

// Решение 1.
// let test = true;
// if (test) {
//     console.log('+++');
// } else {
//     console.log('---');
// }


// Задача 2.
// Проверьте, что переменная test равна 10, то пусть на экран выведется 'yes'. 
// В противном случае пусть ничего не произойдет.

// Решение 2.
// let test = 10;
// if (test == 10) {
//     console.log('yes');
// }


// Задача 3.
// Пусть в переменной num хранится число. 
// Если это число попадает в диапазон от 10 до 99, то найдите сумму цифр этого числа. 
// Если полученная сумма меньше или равна 9, то выведите сообщение о том, что сумма цифр однозначна, 
// в противном случае выведите сообщение о том, что сумма цифр двухзначна.

// Решение 3.
// let num = 24;
// if (num >= 10 && num <= 99) {
//     if ((+String(num)[0] + +String(num)[1]) <= 9) {
//         console.log('Цифра однозначная');
//     } else {
//         console.log('Цифра двухзначна');
//     }
// }