// Задание 1.
// Возведите 2 в 10 степень.

// Решение
// document.write(Math.pow(2, 10));


// Задание 2.
// Найдите квадратный корень из 245.

// Решение
// document.write(Math.sqrt(245));


// Задание 3.
// Дан следующий массив:
// [4, 2, 5, 19, 13, 0, 10]
// Найдите квадратный корень из суммы кубов его элементов. 
// Для решения воспользуйтесь циклом for.

// Решение
// let arr = [4, 2, 5, 19, 13, 0, 10];
// let sum = 0;
// for (let elem of arr) {
//     sum = Math.pow(elem, 3);
// }
// console.log(Math.sqrt(sum));