// Задание 1.
// Возведите 2 в 10 степень.

// Решение
// document.write(Math.pow(2, 10));


// Задание 2.
// Найдите квадратный корень из 245.

// Решение
// document.write(Math.sqrt(245));


// Задание 3.
// Дан следующий массив:
// [4, 2, 5, 19, 13, 0, 10]
// Найдите квадратный корень из суммы кубов его элементов. 
// Для решения воспользуйтесь циклом for.

// Решение
// let arr = [4, 2, 5, 19, 13, 0, 10];
// let sum = 0;
// for (let elem of arr) {
//     sum = Math.pow(elem, 3);
// }
// console.log(Math.sqrt(sum));


// Задание 4. 
// Найдите квадратный корень из 379. 
// Результат округлите до целых, до десятых, до сотых.

// Решение
// console.log(Math.sqrt(379).toFixed())
// console.log(Math.sqrt(379).toFixed(1))
// console.log(Math.sqrt(379).toFixed(2))


// Задание 5.
// Найдите квадратный корень из 587. 
// Округлите результат в большую и меньшую стороны, 
// запишите результаты округления в объект с ключами 'floor' и 'ceil'.

// Решение
// console.log(Math.floor(Math.sqrt(587)));
// console.log(Math.ceil(Math.sqrt(587)));


// Задание 6.
// Даны числа 4, -2, 5, 19, -130, 0, 10. 
// Найдите минимальное и максимальное число.

// Решение
console.log(Math.min(4, -2, 5, 19, -130, 0, 10));
console.log(Math.max(4, -2, 5, 19, -130, 0, 10));