// Задача 1.
// Создайте массив с числами. 
// Выведите его на экран с помощью функции alert, а также выведите его в консоль с помощью console.log

// Решение 1.
// let arr = [1, 2, 3, 4, 5];
// alert(arr);
// console.log(arr);


// Задача 2.
// Создайте массив со строками. 
// Выведите его на экран с помощью функции alert, а также выведите его в консоль с помощью console.log.

// Решение 2.
// let arr = ['str1', 'str2', 'str3'];
// alert(arr);
// console.log(arr);


// Задача 3.
// Создайте массив с произвольными элементами. 
// Выведите на экран количество элементов в этом массиве.

// Решение 3.
// let arr = [1, 2, 3, 'str'];
// alert(arr.length);


// Задача 4.
// Создайте массив с произвольными элементами. 
// Выведите на экран последний элемент этого массива.

// Решение 4.
// let arr = [1, 2, 3, 'str'];
// alert(arr[arr.length-1]);


// Задача 5. 
// Создайте массив с элементами 'a', 'b', 'c'. 
// Запишите вместо первого элемента число 1, вместо второго - 2, вместо третьего - 3.

// Решение 5.
// let arr = ['a', 'b', 'c'];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// alert(arr);


// Задача 6.
// Пусть дан такой массив:
// let arr = [1, 2, 3];
// Добавьте ему в конец элементы 4 и 5.

// Решение 6.
// let arr = [1, 2, 3];
// arr.push(4);
// arr.push(5);