// Задача 1.
// Создайте массив с числами. 
// Выведите его на экран с помощью функции alert, а также выведите его в консоль с помощью console.log

// Решение 1.
// let arr = [1, 2, 3, 4, 5];
// alert(arr);
// console.log(arr);


// Задача 2.
// Создайте массив со строками. 
// Выведите его на экран с помощью функции alert, а также выведите его в консоль с помощью console.log.

// Решение 2.
// let arr = ['str1', 'str2', 'str3'];
// alert(arr);
// console.log(arr);


// Задача 3.
// Создайте массив с произвольными элементами. 
// Выведите на экран количество элементов в этом массиве.

// Решение 3.
// let arr = [1, 2, 3, 'str'];
// alert(arr.length);


// Задача 4.
// Создайте массив с произвольными элементами. 
// Выведите на экран последний элемент этого массива.

// Решение 4.
// let arr = [1, 2, 3, 'str'];
// alert(arr[arr.length-1]);