// Задание 1.
// Сделайте функцию, выводящую в консоль ваше имя.

// Решение
// function func() {
//     console.log('Капурин Никита');
// }
// func();


// Задание 2.
// Сделайте функцию, выводящую в консоль сумму чисел от 1 до 100.

// Решение
// function func() {
//     for (let i = 1; i <= 100; i++) {
//         console.log(i);
//     }
// }
// func();

// Задание 3.
// Сделайте функцию, которая параметром принимает число и выводит в консоль куб этого числа.

// Решение
// function cube(num) {
//     console.log(Math.pow(num, 3));
// }
// cube(19);


// Задание 4.
// Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное. 
// В первом случае пусть функция выводит в консоль текст '+++', а во втором '---'.

// Решение
// function stateNum (num) {
//     if (num > 0) {
//         console.log('+++');
//     } else {
//         console.log('---');
//     }
// }
// stateNum();


// Задание 5.
// Сделайте функцию, которая параметрами принимает 3 числа и выводит в консоль сумму этих чисел.

// Решение
// function sumNum (num1, num2, num3) {
//     console.log(num1 + num2 + num3);
// }


// Задание 6.
// Сделайте функцию, которая параметром принимает число, а возвращает куб этого числа. 
// С помощью этой функции найдите куб числа 3 и запишите его в переменную res.

// Решение
// function cube(num) {
//     return Math.pow(num * 3);
// }
// let res = cube(3);


// Задание 7.
// Сделайте функцию, которая параметром принимает число, 
// а возвращает квадратный корень из этого числа. 
// С помощью этой функции найдите корень числа 3, затем найдите корень числа 4. 
// Просуммируйте полученные результаты и выведите их в консоль.
// function customSqrt(num) {
//     return Math.sqrt(num);
// }
// console.log(customSqrt(3) + customSqrt(4));


// Задание 8.
// Напишите функцию, которая параметром будет принимать число и делить его на 2 столько раз, 
// пока результат не станет меньше 10. Пусть функция возвращает количество итераций, которое 
// потребовалось для достижения результата.

// Решение
// function func(num) {
//     let count = 0;
//     while (num > 10) {
//         num /= 2; 
//         count++
//     }
//     return count;
// }
