// Задание 1.
// Сделайте функцию, выводящую в консоль ваше имя.

// Решение
// function func() {
//     console.log('Капурин Никита');
// }
// func();


// Задание 2.
// Сделайте функцию, выводящую в консоль сумму чисел от 1 до 100.

// Решение
// function func() {
//     for (let i = 1; i <= 100; i++) {
//         console.log(i);
//     }
// }
// func();

// Задание 3.
// Сделайте функцию, которая параметром принимает число и выводит в консоль куб этого числа.

// Решение
// function cube(num) {
//     console.log(Math.pow(num, 3));
// }
// cube(19);


// Задание 4.
// Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное. 
// В первом случае пусть функция выводит в консоль текст '+++', а во втором '---'.

// Решение
// function stateNum (num) {
//     if (num > 0) {
//         console.log('+++');
//     } else {
//         console.log('---');
//     }
// }
// stateNum();