// Задание 1.
// Создайте коллекцию Set. С помощью метода add добавьте в нее элементы. 
// Убедитесь, что дубли элементов не добавляются.
// let set = new Set;

// set.add(1);
// set.add(2);
// set.add(3);
// set.add(3);


// Задание 2.
// С помощью этого массива создайте коллекцию Set.
// let arr = [1, 2, 3, 1, 3, 4];
// let set = new Set(arr);


// Задание 3.
// Создайте коллекцию Set с начальными значениями 1, 2 и 3. С помощью метода add добавьте в коллекцию еще одно число 2. Выведите содержимое коллекции в консоль, убедитесь, что число 2 не добавилось второй раз.
// let set = new Set([1, 2, 3]);

// set.add(3);

// console.log(set);


// Задание 4.
// Создайте коллекцию Set с какими-нибудь числами. Переберите эту коллекцию циклом и найдите сумму ее элементов.
// let set = new Set([1, 2, 3, 4]);

// for (let elem of set) {
//     console.log(elem);
// }