// Задача 1.
// Выведите в консоль все элементы следующего массива:
// let arr = ['a', 'b', 'c', 'd', 'e'];

// Решение 1.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for (let elem of arr) {
//     console.log(elem);
// }


// Задача 2.
// Выведите в консоль все ключи следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 2.
// let obj = {x: 1, y: 2, z: 3};
// for (let key in obj) {
//     console.log(key);
// }


// Задача 3.
// Выведите в консоль все элементы следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 3.
// let obj = {x: 1, y: 2, z: 3};
// for (let key in obj) {
//     console.log(obj[key]);
// }


// Задача 4.
// Выведите в консоль числа от 1 до 100.

// Решение 4.
// let num = 1;
// while (num <= 100) {
//     console.log(num++);
// }


// Задача 5.
// Выведите в консоль числа от 11 до 33.

// Решение 5.
// let num = 11;
// while (num <= 33) {
//     console.log(num++);
// }


// Задача 6.
// Дано число num с неким начальным значением. 
// Умножайте его на 3 столько раз, пока результат умножения не станет больше 1000. 
// Какое число получится? Посчитайте количество итераций, необходимых для этого.

// Решение 6.
// let num = 2;
// let count = 0;
// while (num <= 1000) {
//     num = num * 3;
//     count++;
// }
// console.log(`Число: ${num}, колличество итераций: ${count}`);