// Задача 1.
// Выведите в консоль все элементы следующего массива:
// let arr = ['a', 'b', 'c', 'd', 'e'];

// Решение 1.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for (let elem of arr) {
//     console.log(elem);
// }


// Задача 2.
// Выведите в консоль все ключи следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 2.
// let obj = {x: 1, y: 2, z: 3};
// for (let key in obj) {
//     console.log(key);
// }


// Задача 3.
// Выведите в консоль все элементы следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 3.
// let obj = {x: 1, y: 2, z: 3};
// for (let key in obj) {
//     console.log(obj[key]);
// }


// Задача 4.
// Выведите в консоль числа от 1 до 100.

// Решение 4.
// let num = 1;
// while (num <= 100) {
//     console.log(num++);
// }


// Задача 5.
// Выведите в консоль числа от 11 до 33.

// Решение 5.
// let num = 11;
// while (num <= 33) {
//     console.log(num++);
// }


// Задача 6.
// Дано число num с неким начальным значением. 
// Умножайте его на 3 столько раз, пока результат умножения не станет больше 1000. 
// Какое число получится? Посчитайте количество итераций, необходимых для этого.

// Решение 6.
// let num = 2;
// let count = 0;
// while (num <= 1000) {
//     num = num * 3;
//     count++;
// }
// console.log(`Число: ${num}, колличество итераций: ${count}`);


// Задача 7.
// С помощью цикла for выведите в консоль числа от 1 до 100.

// Решение 7.
// for (let i = 1; i <= 100; i++) {
//     console.log(i);
// }


// Задача 8.
// С помощью цикла for выведите в консоль числа от 11 до 33.

// Решение 8.
// for (let i = 11; i <= 33; i++) {
//     console.log(i);
// }


// Задача 9.
// С помощью цикла for выведите в консоль четные числа в промежутке от 0 до 100.

// Решение 9.
// for(let i = 1; i <= 100; i++) {
//     if (i % 2 == 0) {
//         console.log(i);
//     }
// }


// Задача 10.
// С помощью цикла for выведите в консоль нечетные числа в промежутке от 1 до 99.

// Решение 10.
// for(let i = 1; i <= 100; i++) {
//     if (i % 2 != 0) {
//         console.log(i);
//     }
// }


// Задача 11.
// С помощью цикла for выведите в консоль числа от 100 до 0.

// Решение 11.
// for (let i = 100; i >= 0; i--) {
//     console.log(i);
// }


// Задача 12.
// Выведите в консоль все элементы следующего массива:
// let arr = ['a', 'b', 'c', 'd', 'e'];

// Решение 12.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }


// Задача 13.
// Выведите в консоль все элементы следующего массива, за исключением нулевого и последнего:

// Решение 13.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for (let i = 0; i < arr.length - 1; i++) {
//     console.log(arr[i]);
// }


// Задача 14.
// Выведите в консоль элементы следующего массива в обратном порядке:
// let arr = ['a', 'b', 'c', 'd', 'e'];

// Решение 14.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for(let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }


// Задача 15.
// Выведите в консоль те элементы объекта, значения которых - нечетные числа.

// Решение 15.
// let obj = {a: 1, b: 2, c: 3, d: 4, e: 5};
// for (let elem in obj) {
//     if (obj[elem] % 2 == 0) {
//         console.log(obj[elem]);
//     }
// }


// Задача 16.
// Найдите сумму четных чисел от 2 до 100.

// Решение 16.
// let res = 0;
// for (let i = 1; i <= 100; i++) {
//     if (i % 2 == 0) {
//         res += i;
//     }
// }
// console.log(res);


// Задача 17.
// Найдите сумму нечетных чисел от 1 до 99.

// Решение 17.
// let res = 0;
// for (let i = 0; i <= 100; i++) {
//     if (i % 2 != 0) {
//         res += i;
//     }
// }
// console.log(res);


// Задача 18.
// Найдите произведение целых чисел от 1 до 20.

// Решение 18.
// let res = 1;
// for (let i = 1; i <= 20; i++) {
//     res *= i;
// }