// Задача 1.
// Выведите в консоль все элементы следующего массива:
// let arr = ['a', 'b', 'c', 'd', 'e'];

// Решение 1.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for (let elem of arr) {
//     console.log(elem);
// }


// Задача 2.
// Выведите в консоль все ключи следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 2.
// let obj = {x: 1, y: 2, z: 3};
// for (let key in obj) {
//     console.log(key);
// }


// Задача 3.
// Выведите в консоль все элементы следующего объекта:
// let obj = {x: 1, y: 2, z: 3};

// Решение 3.
// let obj = {x: 1, y: 2, z: 3};
// for (let key in obj) {
//     console.log(obj[key]);
// }